#****************************************************
#Note: 	clocks and reset signals were assumed as ideal
#****************************************************

#****************************************************
#MAX freq : 125M
set SYS_CLK_PERIOD 20.0
#****************************************************

#****************************************************
date
#****************************************************

# Define some variables for design
#****************************************************
set TOP_MODULE		jpeg_asic
set Rst_list		[list PAD_rst_i ]
set Clk_list		[list PAD_clk_i ]

#Read netlist
read_verilog	data_bend/jpeg_asic.lvs.vg
current_design $TOP_MODULE
link_design

#****************************************************
# Define The Design Enviroment
#****************************************************

set_min_library smic18_ss.db -min_version smic18_ff.db
set_min_library smic18IO_line_ss.db -min_version smic18IO_line_ff.db
#set_min_library smic18IO_stagger_ss.db -min_version smic18IO_stagger_ff.db

#set_min_library  vs_dp_16x64_worst.db	-min_version vs_dp_16x64_best.db


#Read SPEF
reset_design
read_parasitics  data_bend/jpeg_asic.spef 

#set_operating_conditions -analysis_type bc_wc -min best -max worst
#
set_wire_load_mode  "segmented"
set_wire_load_model -name reference_area_10000000 -library smic18_ss




#****************************************************
# clock defination and reset
#****************************************************
#MAX freq : 125M
#physical clock and reset

#should use pins? Can PAD_* be used?


create_clock -name wb_clk -period $SYS_CLK_PERIOD -waveform [list 0 [expr $SYS_CLK_PERIOD /2]]  [get_ports PAD_clk_i]

set_propagated_clock [all_clocks]

report_clocks -nosplit >  ${reportsDir}/${TOP_MODULE}.clocks.txt

#****************************************************
# drive and load, max_fanout,max_capacitance
#****************************************************
#set MAX_LOAD	[load_of smic18_ss/NAND2HD2X/A]
set MAX_LOAD [load_of smic18_ss/INVHD4X/A]

set_drive 0	[get_ports "$Rst_list"]
set_drive 0 	[get_ports "$Clk_list"]

set_driving_cell -lib_cell INVHD2X [remove_from_collection [all_inputs] \
         [get_ports [list PAD_clk_i PAD_rst_i ]]]

#set_max_capacitance [expr $MAX_LOAD*12] [get_designs *]

set_load [expr $MAX_LOAD*3] [all_outputs]

set_max_fanout 10 [all_inputs]

#set_max_transition 1.0 $TOP_MODULE

#****************************************************
# input delay and output delay
# input delay and output delay were set to 50% clock period
#****************************************************

#should use -max and -min

#define ports (exclude *clk ports)
#jtag ports; use set_case_analysis?
#input delay : max : period - setup
#input delay : min : hold
#output delay : max : setup
#output delay : min : -hold

set wb_in_ports [remove_from_collection [all_inputs]  [get_ports [list PAD_clk_i PAD_rst_i]]]
set wb_out_ports [get_ports [list PAD_jpeg_bitstr_o PAD_dat_rdy_o PAD_eof_bitstr_cnt_o PAD_eof_dat_partial_rdy_o]]

set_input_delay -max 10 -clock wb_clk $wb_in_ports
set_input_delay -min 0.1 -clock wb_clk $wb_in_ports

set_output_delay -max 10 -clock wb_clk $wb_out_ports
set_output_delay -min -1 -clock wb_clk $wb_out_ports

#exit


#****************************************************
# false path
#****************************************************
#set_case_analysis is enough?
set_false_path -from [get_ports "$Rst_list"]


#****************************************************
# case_analysis
#****************************************************

set_case_analysis 0 [get_pins "U_rst_i/D"]


#****************************************************
#  Output Reports
#****************************************************

report_design -nosplit >  ${reportsDir}/${TOP_MODULE}.design.txt
report_port -nosplit >  ${reportsDir}/${TOP_MODULE}.port.txt
report_net -nosplit >  ${reportsDir}/${TOP_MODULE}.net.txt
report_constraint -nosplit -all_violators >  ${reportsDir}/${TOP_MODULE}.constraint.txt
report_timing -nosplit >  ${reportsDir}/${TOP_MODULE}.timing.txt

#****************************************************
#  Output Results
#****************************************************

#write_sdf  ${reportsDir}/${TOP_MODULE}_post_APR.sdf

write_sdf  data_bend/${TOP_MODULE}_post_APR.PT.sdf

date

#****************************************************
#  Finish and Quit
#****************************************************
exit
